import { Component, OnInit, Input } from '@angular/core';

@Component({
  selector: 'sixnes-erotiseis',
  templateUrl: './sixnes-erotiseis.component.html',
  styleUrls: ['./sixnes-erotiseis.component.css']
})
export class SixnesErotiseisComponent implements OnInit {

  erwthseis = [
    ['Ποια είναι η νέα τιμολογιακή πολιτική;', 'Καθιερώνονται νεές κάρτες απειόριστων διαδρομών και νέα εισητήρια που παρέχουν πρόσβαση σε όλα τα συγκοινωνιακά Μέσα, \
    επιτρέπουν τις μετεπιβιβάσεις και προάγουν την καλύτερη εξυπηρέτηση των επιβατών. Καταργούνται κάρτεσ και εισητήρια για μεμονομένα Μέσα. Μειώνονται οι τιμές στις κάρτες \
    απεριόριστων διαδρομών για όλα τα Μέσα, καθιερώνονται νέοι τύποι καρτών με διάρκεια ισχ΄θος μικρότερης του έτους (εξαμηνιαίες και τριμηνίαιες) και τύποι καρτών για τους διακαιούχους\
    του μειωμένου κομίστρου. \
    \
    Αιχμή της νέας τιμολογιακής πολιτικής είανι η μηνιαία καρτά απεριόριστων διαδρομών για όλα τα Μέσα (30€ και μειωμένη 15€) που δίνει στους επιβάτες τη δυνατότητα μετακίνησης με όλα τα Μέσα με 1€\
    την ημέρα και στους δικαιούχους μειωμένου κομίστρου με 0,50€ την ημέρα.' ]
    ,
    ['Τι έιναι οι Συγκοινωνίες Αθηνών;', 'Οι Συγκοινωνίες Αθηνών αποτελόυνται απο τις εταιρίες Ο.Α.Σ.Α Α.Ε., ΣΤΑ.ΣΥ. Α.Ε. (μετρό, ηλεκτρικός και τραμ) και Ο.Σ.Υ. Α.Ε. (λεωφορέία και τρόλεϊ) οι οποίες \
    προσφέρουν δημόσιες υπηρεσίες αστικής μετακίνησης και οι οποίες λειτουργούν με τρόπο ενιαίο γι αν ακάνουν πραγματικότητα την ιδέα: "Μια πόλη. Ένα δίκτυο."'],
    ['Από πότε ισχύει η Νέα Τιμολογιακή Πολιτική των Συγκοινωνιών Αθηνών;','Η Νέα Τιμολογιακή Πολιτική ισχύει απο την 1η Σεπτεμβρίου 2014.']
  ];

  constructor() { }
  title = "TITLOS";
  title2 = "dasdasdasda";
  
  isExpanded: boolean[] = [];

  ngOnInit() {
    var i;
    for(i = 0 ; i < this.erwthseis.length ; i++ ){
      this.isExpanded[i] = false;
      // console.log('asd')
    }
  }

  toggle(er) {
    var i;
    i = this.erwthseis.indexOf(er)
    console.log(i);
    this.isExpanded[i] = !this.isExpanded[i];
  }

  implementation(erwthseis) {
    for(var i= 0 ; i < this.erwthseis.length ; i++ ){
      // this.erwthseis[]
      // console.log('asd')
    }
  }

}
